@emerkle826 Using `astra_streaming_tenant_tokens` still forces a replacement on each apply.

```
-/+ resource "google_secret_manager_secret_version" "main" {
      ~ create_time  = "2022-11-28T11:09:11.367482Z" -> (known after apply)
      + destroy_time = (known after apply)
      ~ id           = "projects/.../versions/12" -> (known after apply)
      ~ name         = "projects/.../versions/12" -> (known after apply)
      ~ secret_data  = (sensitive value) # forces replacement
      ~ version      = "12" -> (known after apply)
        # (2 unchanged attributes hidden)
    }
```